[
  {
    "id": 0,
    "location": "Lift Lobby",
    "north": null,
    "south": null,
    "west": 1,
    "east": null,
    "monsters": null,
    "treasure": null,
    "description": "I AM IN THE LIFT LOBBY"
  },
  {
    "id": 1,
    "location": "Office Lobby ",
    "north": 2,
    "south": null,
    "west": null,
    "east": 0,
    "monsters": null,
    "treasure": {
      "type": "cookies",
      "amount": 5
    },
    "description": "Office lobby tbc"
  },
  {
    "id": 2,
    "location": "Admin Desk",
    "north": 3,
    "south": 1,
    "west": null,
    "east": null,
    "monsters": null,
    "treasure": {
      "type": "cookies",
      "amount": 5
    },
    "description": "Say Hi to Cheryl as you pass the Admmin desk."
  },
  {
    "id": 3,
    "location": "Hallway 1",
    "north": 4,
    "south": 2,
    "west": 16,
    "east": 7,
    "monsters": null,
    "treasure": null,
    "description": "A long hallway stretches infront of you.. As you approch the main office, the sound of clicky keyboards hits your ears like a machine gun. The HotDesk has never been busier. Papers flying, people hustling, music thumping...everything feels different.. How ever will you find the desk you were at!"
  },

  {
    "id": 4,
    "location": "Pantry 1",
    "north": null,
    "south": 3,
    "west": null,
    "east": 5,
    "monsters": null,
    "treasure": {
      "type": "cookies",
      "amount": 5
    },
    "description": "You have reached the pantry. You see some delicious cookies lying there.. free for all.. A snack could help jog your memory.. "
  },
  {
    "id": 5,
    "location": "HotDesk Zone 1",
    "north": null,
    "south": 7,
    "west": 4,
    "east": 6,
    "monsters": null,
    "treasure": null,
    "description": "You reach the desk by the window. Staring intensely at the current occupant makes him look up awkwardly from his screen..\"Can I help you...?\" he says. Stress causes you to blurt out \"Paper.. on the seat\" then start to probe at his chair, throwing him to the ground"
  },
  {
    "id": 6,
    "location": "Hallway 2",
    "north": null,
    "south": null,
    "west": 10,
    "east": 5,
    "monsters": null,
    "treasure": null,
    "description": "Another hallyway! Man this place is huge. Beads of sweat decorate your brow now. your time is running out"
  },
  {
    "id": 7,
    "location": "Couches",
    "north": 8,
    "south": 5,
    "west": 3,
    "east": null,
    "monsters": null,
    "treasure": null,
    "description": "GA students are lounging around! Cables twist all around the floor. Watch your step.."
  },
  {
    "id": 8,
    "location": "HotDesk Zone 2",
    "north": null,
    "south": 7,
    "west": null,
    "east": 9,
    "monsters": null,
    "treasure": null,
    "description": "A second office space unfolds as you slide open the glass door. You search the first few desks for your resume. As you pull out the chair a rat jumps up at you. EEkk!"
  },
  {
    "id": 9,
    "location": "Pantry 2",
    "north": 10,
    "south": null,
    "west": 8,
    "east": null,
    "monsters": null,
    "treasure": {
      "type": "milo",
      "amount": 7
    },
    "description": "This search has been exhausting. You need some energy. Drink a milo"
  },
  {
    "id": 10,
    "location": "HotDesk zone 3",
    "north": null,
    "south": 9,
    "west": 15,
    "east": 6,
    "monsters": null,
    "treasure": null,
    "description": "As you enter the work space, your breath condenses in the air... a chill runs down your spine as a wall of frozen air ensnares you... you reach for your jacket but drop it with the lost sensation of your fingers.. reaching down to pick it up you notice your legs are frozen solid to the ground. /n Choose an object to help yourself get free "
  },
  {
    "id": 11,
    "location": "Fire Escape",
    "north": null,
    "south": null,
    "west": 12,
    "east": 13,
    "monsters": null,
    "treasure": null,
    "description": " No more of this madness! You need to make up time. You found the fire excape to reach the second level of HotDesk. Level UP!"
  },
  {
    "id": 12,
    "location": "Office Space",
    "north": null,
    "south": null,
    "west": 16,
    "east": 11,
    "monsters": null,
    "treasure": null,
    "description": ""
  },
  {
    "id": 13,
    "location": "Projector Room",
    "north": 14,
    "south": null,
    "west": 11,
    "east": null,
    "monsters": null,
    "treasure": null,
    "description": "Entering the dark room, you hear cheers of football fans.. the glowing screen lights up a few familiar faces .. They're software engineers you overheard chatting about pull requests yesterday.. but how are they playing FIFA already.. surely it's only 2pm. You check your watch.. Oh dear! You're running out of time!"
  },
  {
    "id": 14,
    "location": "Printing room",
    "north": 15,
    "south": 13,
    "west": null,
    "east": null,
    "monsters": null,
    "treasure": null,
    "description": "It's thesis submition time and the printers have jammed.. yet again..causing a commotion of office ladies fussing over the solution. Trays of paper are being pulled here and there. Distracted as you carefully step over a large box of fresh paper packets, you are confronted with a mountain of crumpled paper ripped out and tossed aside in frustration. The mass suddenly starts moving towards you, seemingly falling, but then you notice the lumpy eyes and toothy staple grin. It's go time!"
  },
  {
    "id": 15,
    "location": "Meeting room",
    "north": null,
    "south": 14,
    "west": 10,
    "east": 17,
    "monsters": null,
    "treasure": null,
    "description": "walking past this room you see an old colleague. They usher you in. It appears to be an office lunch party... YES! You think... all this searching is making you hungry.. You help yourself to one of the sandwiches laid out on the table.. /n as you do, all the people in the room stop and turn. Their eyes become fixated on you and your sandwich.. How will you get out of this one.. "
  },
  {
    "id": 16,
    "location": "Office Space",
    "north": 3,
    "south": null,
    "west": null,
    "east": 12,
    "monsters": null,
    "treasure": null,
    "description": "Everyone is at their desk working hard. You scour the room but no sign of your document"
  },
  {
    "id": 17,
    "location": "HotDesk zone 4",
    "north": null,
    "south": null,
    "west": null,
    "east": null,
    "monsters": null,
    "treasure": {
      "type": "resume",
      "amount": "50"
    },
    "description": "You've made it! You slide out the chair to find a pristine resume. The refreshing feeling of success and wave of relief is interupted by a distinct sound.. As you turn around slowly, you realisse you were in fact sitting at the first desk in front of the elevators.. "
  }
]
